// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DriversStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell shellenv command
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"
#langdef   fra "Français"


#string STR_SHELLENV_PROTID_DRIVERS_BAD_LANG  #language eng  "%hs: Invalid language value '%hs'.\n"

#string STR_SHELLENV_PROTID_H_T_DN          #language eng  "%H            T   D%N\n"

#string STR_SHELLENV_PROTID_HD_YC_IN        #language eng  "%HD           Y C I%N\n"

#string STR_SHELLENV_PROTID_HR_PF_AN        #language eng  "%HR           P F A%N\n"

#string STR_SHELLENV_PROTID_HV_VERSION      #language eng  "%HV  VERSION  E G G #D #C DRIVER NAME                         IMAGE NAME%N\n"

#string STR_SHELLENV_PROTID_H_EQUAL_SIGNS_N #language eng  "%H== ======== = = = == == =================================== ===================%N\n"

#string STR_SHELLENV_PROTID_TWO_VARS_H_X    #language eng  "%h02x %08x"

#string STR_SHELLENV_PROTID_ONE_VAR_D       #language eng  " %2d"

#string STR_SHELLENV_PROTID_ONE_VAR_S_2     #language eng  " %s"

#string STR_SHELLENV_PROTID_UNKNOWN_2       #language eng  "<UNKNOWN>\n"

#string STR_SHELLENV_PROTID_ONE_VAR_S       #language eng  "%s\n"

#string STR_DRIVERS_LINE_HELP          #language eng  "Displays the EFI driver list"

#string STR_DRIVERS_VERBOSE_HELP       #language eng  "Displays the EFI driver list.\n"
                                                      "\n"
                                                      "DRIVERS [-l XXX]\n"
                                                      "\n"
                                                      "    -l           - Display drivers using the specified ISO 639-2 language\n"
                                                      "\n"
                                                      "Display Format:\n"
                                                      "    DRV          - Handle number of the EFI driver\n"
                                                      "    TYPE         - Driver type:\n"
                                                      "                     [B]  - Bus Driver\n"
                                                      "                     [D]  - Device Driver\n"
                                                      "    CFG          - Driver supports the Driver Configuration Protocol\n"
                                                      "    DIAG         - Driver supports the Driver Diagnostics Protocol\n"
                                                      "    #D           - Number of devices managed by the driver\n"
                                                      "    #C           - Number of child devices produced by the driver\n"
                                                      "    DRIVER NAME  - Name of the driver from the Component Name Protocol\n"
                                                      "    IMAGE NAME   - File path from which the driver was loaded\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the list:\n"
                                    						      "    Shell> drivers\n"
                                    						      "            T   D\n"
                                    						      "D           Y C I\n"
                                    						      "R           P F A\n"
                                    						      "V  VERSION  E G G #D #C DRIVER NAME                         IMAGE NAME\n"
                                    						      "== ======== = = = == = ================================== ===================\n"
                                    						      "39 00000010 D - - 1  - Platform Console Management Driver ConPlatform\n"
                                    						      "3A 00000010 D - - 1  - Platform Console Management Driver ConPlatform\n"
                                    						      "3B 00000010 B - - 1  1 Console Splitter Driver            ConSplitter\n"
                                    						      "3C 00000010 ? - - -  - Console Splitter Driver            ConSplitter\n"
                                    						      "3D 00000010 B - - 1  1 Console Splitter Driver            ConSplitter\n"
                                    						      "3E 00000010 ? - - -  - Console Splitter Driver            ConSplitter\n"
                                    						      "42 00000010 D - - 1  - UGA Console Driver                 GraphicsConsole\n"
                                    						      "43 00000010 ? - - -  - Serial Terminal Driver             Terminal\n"
                                    						      "44 00000010 D - - 1  - Generic Disk I/O Driver            DiskIo\n"
                                    						      "45 00000010 D - - 1  - FAT File System Driver             Fat\n"
                                    						      "48 00000010 ? - - -  - ISA Bus Driver                     IsaBus\n"
                                    						      "49 00000010 ? - - -  - ISA Serial Driver                  IsaSerial\n"
                                    						      "4C 00000010 B - - 1  1 PCI Bus Driver                     PciBus\n"
                                    						      "55 00000010 D X X 1  - Windows Block I/O Driver           WinNtBlockIo\n"
                                    						      "56 00000010 ? - - -  - Windows Text Console Driver        WinNtConsole\n"
                                    						      "57 00000010 ? - - -  - Windows Serial I/O Driver          WinNtSerialIo\n"
                                    						      "58 00000010 D - - 1  - Windows Simple File System Driver  WinNtSimpleFileSystem\n"
                                    						      "59 00000010 B - - 1  3 Windows Bus Driver                 WinNtBusDriver\n"
                                    						      "5F 00000010 D - - 1  - Windows Universal Graphics Adapter WinNtUga\n"
